# üöÄ Import relevant packages and dataset

In [5]:
pip install nltk

Collecting nltk
  Obtaining dependency information for nltk from https://files.pythonhosted.org/packages/a6/0a/0d20d2c0f16be91b9fa32a77b76c60f9baf6eba419e5ef5deca17af9c582/nltk-3.8.1-py3-none-any.whl.metadata
  Downloading nltk-3.8.1-py3-none-any.whl.metadata (2.8 kB)
Collecting click (from nltk)
  Obtaining dependency information for click from https://files.pythonhosted.org/packages/00/2e/d53fa4befbf2cfa713304affc7ca780ce4fc1fd8710527771b58311a3229/click-8.1.7-py3-none-any.whl.metadata
  Downloading click-8.1.7-py3-none-any.whl.metadata (3.0 kB)
Collecting joblib (from nltk)
  Obtaining dependency information for joblib from https://files.pythonhosted.org/packages/ae/e2/4dea6313ef2b38442fccbbaf4017e50a6c3c8a50e8ee9b512783e5c90409/joblib-1.4.0-py3-none-any.whl.metadata
  Downloading joblib-1.4.0-py3-none-any.whl.metadata (5.4 kB)
Collecting regex>=2021.8.3 (from nltk)
  Obtaining dependency information for regex>=2021.8.3 from https://files.pythonhosted.org/packages/4b/35/ff1194913e4b88b95ecaddd8aa6315bc81b97e8f3e2e6ce0dee91c3bb2b1/regex-2024.4.16-cp312-cp312-win_amd64.whl.metadata
  Downloading regex-2024.4.16-cp312-cp312-win_amd64.whl.metadata (41 kB)
     ---------------------------------------- 0.0/42.0 kB ? eta -:--:--
     ---------------------------------------- 0.0/42.0 kB ? eta -:--:--
     ------------------ ------------------- 20.5/42.0 kB 330.3 kB/s eta 0:00:01
     -------------------------------------- 42.0/42.0 kB 511.8 kB/s eta 0:00:00
Collecting tqdm (from nltk)
  Obtaining dependency information for tqdm from https://files.pythonhosted.org/packages/2a/14/e75e52d521442e2fcc9f1df3c5e456aead034203d4797867980de558ab34/tqdm-4.66.2-py3-none-any.whl.metadata
  Downloading tqdm-4.66.2-py3-none-any.whl.metadata (57 kB)
     ---------------------------------------- 0.0/57.6 kB ? eta -:--:--
     ---------------------------------------- 57.6/57.6 kB 1.5 MB/s eta 0:00:00
Requirement already satisfied: colorama in c:\users\andre\appdata\roaming\python\python312\site-packages (from click->nltk) (0.4.6)
Downloading nltk-3.8.1-py3-none-any.whl (1.5 MB)
   ---------------------------------------- 0.0/1.5 MB ? eta -:--:--
   ---------- ----------------------------- 0.4/1.5 MB 11.9 MB/s eta 0:00:01
   -------------------------- ------------- 1.0/1.5 MB 12.5 MB/s eta 0:00:01
   ---------------------------------------  1.5/1.5 MB 13.7 MB/s eta 0:00:01
   ---------------------------------------- 1.5/1.5 MB 10.6 MB/s eta 0:00:00
Downloading regex-2024.4.16-cp312-cp312-win_amd64.whl (268 kB)
   ---------------------------------------- 0.0/268.4 kB ? eta -:--:--
   --------------------------------------- 268.4/268.4 kB 16.1 MB/s eta 0:00:00
Downloading click-8.1.7-py3-none-any.whl (97 kB)
   ---------------------------------------- 0.0/97.9 kB ? eta -:--:--
   ---------------------------------------- 97.9/97.9 kB 5.5 MB/s eta 0:00:00
Downloading joblib-1.4.0-py3-none-any.whl (301 kB)
   ---------------------------------------- 0.0/301.2 kB ? eta -:--:--
   --------------------------------------- 301.2/301.2 kB 18.2 MB/s eta 0:00:00
Downloading tqdm-4.66.2-py3-none-any.whl (78 kB)
   ---------------------------------------- 0.0/78.3 kB ? eta -:--:--
   ---------------------------------------- 78.3/78.3 kB ? eta 0:00:00
Installing collected packages: tqdm, regex, joblib, click, nltk
Successfully installed click-8.1.7 joblib-1.4.0 nltk-3.8.1 regex-2024.4.16 tqdm-4.66.2
Note: you may need to restart the kernel to use updated packages.

  WARNING: The script tqdm.exe is installed in 'c:\Users\andre\AppData\Local\Programs\Python\Python312\Scripts' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.
  WARNING: The script nltk.exe is installed in 'c:\Users\andre\AppData\Local\Programs\Python\Python312\Scripts' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.

[notice] A new release of pip is available: 23.2.1 -> 24.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [6]:
#import nlkt libraries
import nltk

nltk.download('stopwords')
nltk.download('punkt')
nltk.download('wordnet')
nltk.download('omw-1.4')

[nltk_data] Downloading package stopwords to
[nltk_data]     C:\Users\andre\AppData\Roaming\nltk_data...
[nltk_data]   Unzipping corpora\stopwords.zip.
[nltk_data] Downloading package punkt to
[nltk_data]     C:\Users\andre\AppData\Roaming\nltk_data...
[nltk_data]   Unzipping tokenizers\punkt.zip.
[nltk_data] Downloading package wordnet to
[nltk_data]     C:\Users\andre\AppData\Roaming\nltk_data...
[nltk_data] Downloading package omw-1.4 to
[nltk_data]     C:\Users\andre\AppData\Roaming\nltk_data...

True

In [9]:
import pandas as pd
import numpy as np
import string
from num2words import num2words

ModuleNotFoundError: No module named 'pandas'

In [8]:
df = pd.read_csv('Text_Similarity_Dataset.csv')

NameError: name 'pd' is not defined

# üîéFirst dataset exploration

In [ ]:
df.head(20)

,Unique_ID,text1,text2
0,0,savvy searchers fail to spot ads internet sear...,newcastle 2-1 bolton kieron dyer smashed home ...
1,1,millions to miss out on the net by 2025 40% o...,nasdaq planning $100m share sale the owner of ...
2,2,young debut cut short by ginepri fifteen-year-...,ruddock backs yapp s credentials wales coach m...
3,3,diageo to buy us wine firm diageo the world s...,mci shares climb on takeover bid shares in us ...
4,4,be careful how you code a new european directi...,media gadgets get moving pocket-sized devices ...
5,5,india seeks to boost construction india has cl...,music mogul fuller sells company pop idol supr...
6,6,podcasters look to net money nasa is doing it...,ukip outspent labour on eu poll the uk indepen...
7,7,row over police power for csos the police fe...,ban on hunting comes into force fox hunting wi...
8,8,election could be terror target terrorists m...,nhs waiting time target is cut hospital waitin...
9,9,japan economy slides to recession the japanese...,optimism remains over uk housing the uk proper...
10,10,lufthansa flies back to profit german airline ...,applegate s charity show closes us musical swe...
11,11,sprinter walker quits athletics former europea...,ferguson urges henry punishment sir alex fergu...
12,12,gervais writing simpsons episode the office s ...,no charges against tv s cosby us comedian bill...
13,13,kenyan school turns to handhelds at the mbita ...,more women turn to net security older people a...
14,14,us woman sues over ink cartridges a us woman i...,more power to the people says hp the digital r...
15,15,bond game fails to shake or stir for gaming fa...,mobile multimedia slow to catch on there is no...
16,16,oscars race enters final furlong the race for ...,label withdraws mcfadden s video the new video...
17,17,charvis set to lose fitness bid flanker colin ...,the force is strong in battlefront the warm re...
18,18,mobile multimedia slow to catch on there is no...,text messages aid disaster recovery text messa...
19,19,us firm bids for lacroix label a us firm has...,yukos seeks court action on sale yukos will re...

In [ ]:
df.info

<bound method DataFrame.info of       Unique_ID                                              text1  \
0             0  savvy searchers fail to spot ads internet sear...
1             1  millions to miss out on the net by 2025  40% o...
2             2  young debut cut short by ginepri fifteen-year-...
3             3  diageo to buy us wine firm diageo  the world s...
4             4  be careful how you code a new european directi...
...         ...                                                ...
4018       4018  labour plans maternity pay rise maternity pay ...
4019       4019  high fuel costs hit us airlines two of the lar...
4020       4020  britons growing  digitally obese  gadget lover...
4021       4021  holmes is hit by hamstring injury kelly holmes...
4022       4022  nuclear dumpsite  plan attacked plans to allow...

                                                  text2
0     newcastle 2-1 bolton kieron dyer smashed home ...
1     nasdaq planning $100m share sale the owner of ...
2     ruddock backs yapp s credentials wales coach m...
3     mci shares climb on takeover bid shares in us ...
4     media gadgets get moving pocket-sized devices ...
...                                                 ...
4018  no seasonal lift for house market a swathe of ...
4019  new media battle for bafta awards the bbc lead...
4020  film star fox behind theatre bid leading actor...
4021  tsunami  to hit sri lanka banks  sri lanka s b...
4022  x factor show gets second series tv talent sho...

[4023 rows x 3 columns]>

In [ ]:
df.shape

(4023, 3)

In [ ]:
df.isnull().sum().sum()

0

In [ ]:
df.duplicated().sum()

0

# üßπCleaning text

In [ ]:
df.head()

,Unique_ID,text1,text2
0,0,savvy searchers fail to spot ads internet sear...,newcastle 2-1 bolton kieron dyer smashed home ...
1,1,millions to miss out on the net by 2025 40% o...,nasdaq planning $100m share sale the owner of ...
2,2,young debut cut short by ginepri fifteen-year-...,ruddock backs yapp s credentials wales coach m...
3,3,diageo to buy us wine firm diageo the world s...,mci shares climb on takeover bid shares in us ...
4,4,be careful how you code a new european directi...,media gadgets get moving pocket-sized devices ...

In [ ]:
# Check if the 'text1' contains digit numbers
contains_digits1 = df['text1'].apply(lambda x: any(char.isdigit() for char in x))
contains_digits1.sum()

3833

In [ ]:
## Check if the 'text2' contains digit numbers
contains_digits2 = df['text2'].apply(lambda x: any(char.isdigit() for char in x))
contains_digits2.sum()

3824

In [ ]:
#!pip install num2words

In [ ]:
def basic_cleaning(text):
    # Ensure that text is a string
    text = str(text)
    # 1. Removing whitespaces
    text = text.strip()
    # 2. Lowercasing
    digits = ''.join(filter(str.isdigit, text))
    if digits:
        return num2words(int(digits))
    else:
        return text
    # 3. Changing digits to words
    text = num2words(text)
    # 4. Removing punctuation
    for punctuation in string.punctuation:
        text = text.replace(punctuation, " ")
    return text

# Apply basic_cleaning function to whole dataset
df['text1'] = df['text1'].apply(basic_cleaning)
df['text2'] = df['text2'].apply(basic_cleaning)

df.head()

,Unique_ID,text1,text2
0,0,"eight hundred and seventy-eight nonillion, fou...","twenty-one octillion, one hundred and three se..."
1,1,"two hundred and two quadrillion, five hundred ...","one octillion, one septillion, five sextillion..."
2,2,"sixty-two duodecillion, six hundred and twenty...",twenty-one
3,3,"two septillion, six hundred and one sextillion...","six octillion, three hundred and thirty-four s..."
4,4,"fifty-two trillion, one hundred and ninety-sev...","two hundred octillion, five hundred and ten se..."

In [ ]:
# Check if the function remove numbers worked
contains_digits1 = df['text1'].apply(lambda x: any(char.isdigit() for char in x))
contains_digits1.sum()

0

In [ ]:
# Check if the function remove numbers worked
contains_digits2 = df['text2'].apply(lambda x: any(char.isdigit() for char in x))
contains_digits2.sum()

0

In [ ]:
import re

def regex(text):
    if isinstance(text, list):
        return [re.sub('<[^<]+?->', '', word) for word in text]
    else:
        return re.sub('<[^<]+?->', '', text)

# Tokenized  all rows in both columns
df['text1']= df['text1'].apply(regex)
df['text2']= df['text2'].apply(regex)

df.head()

,Unique_ID,text1,text2
0,0,"eight hundred and seventy-eight nonillion, fou...","twenty-one octillion, one hundred and three se..."
1,1,"two hundred and two quadrillion, five hundred ...","one octillion, one septillion, five sextillion..."
2,2,"sixty-two duodecillion, six hundred and twenty...",twenty-one
3,3,"two septillion, six hundred and one sextillion...","six octillion, three hundred and thirty-four s..."
4,4,"fifty-two trillion, one hundred and ninety-sev...","two hundred octillion, five hundred and ten se..."

In [ ]:
from nltk.tokenize import word_tokenize

# Function to tokenized
def tokenized(text):
    if isinstance(text, str):
        return word_tokenize(text)
    else:
        return []

# Tokenized all rows in both columns
df['text1'] = df['text1'].apply(tokenized)
df['text2'] = df['text2'].apply(tokenized)

df.head()

,Unique_ID,text1,text2
0,0,"[eight, hundred, and, seventy-eight, nonillion...","[twenty-one, octillion, ,, one, hundred, and, ..."
1,1,"[two, hundred, and, two, quadrillion, ,, five,...","[one, octillion, ,, one, septillion, ,, five, ..."
2,2,"[sixty-two, duodecillion, ,, six, hundred, and...",[twenty-one]
3,3,"[two, septillion, ,, six, hundred, and, one, s...","[six, octillion, ,, three, hundred, and, thirt..."
4,4,"[fifty-two, trillion, ,, one, hundred, and, ni...","[two, hundred, octillion, ,, five, hundred, an..."

In [ ]:
from nltk.corpus import stopwords
from nltk import word_tokenize

stop_words = set(stopwords.words('english'))

# Function to remove StopWords
def remove_stopwords(text):
    if isinstance(text, list):
        return [word for word in text if word.lower() not in stop_words]
    else:
        tokenized = word_tokenize(text)
        without_stopwords = [word for word in tokenized if word.lower() not in stop_words]
        return without_stopwords

# Remove stopwords from all rows in both columns
df['text1'] = df['text1'].apply(remove_stopwords)
df['text2'] = df['text2'].apply(remove_stopwords)

df.head()

,Unique_ID,text1,text2
0,0,"[eight, hundred, seventy-eight, nonillion, ,, ...","[twenty-one, octillion, ,, one, hundred, three..."
1,1,"[two, hundred, two, quadrillion, ,, five, hund...","[one, octillion, ,, one, septillion, ,, five, ..."
2,2,"[sixty-two, duodecillion, ,, six, hundred, twe...",[twenty-one]
3,3,"[two, septillion, ,, six, hundred, one, sextil...","[six, octillion, ,, three, hundred, thirty-fou..."
4,4,"[fifty-two, trillion, ,, one, hundred, ninety-...","[two, hundred, octillion, ,, five, hundred, te..."

In [ ]:
from nltk.stem import WordNetLemmatizer

#Create a function to Lemmatize
def lemma(text):
    lemmatizer = WordNetLemmatizer() # Instantiate lemmatizer
    lemmatized = [lemmatizer.lemmatize(word) for word in text] # Lemmatize
    lemmatized_string = " ".join(lemmatized)
    return lemmatized_string

df['text1'] = df['text1'].apply(lemma)
df['text2'] = df['text2'].apply(lemma)

df.head()

,Unique_ID,text1,text2
0,0,"eight hundred seventy-eight nonillion , four h...","twenty-one octillion , one hundred three septi..."
1,1,"two hundred two quadrillion , five hundred for...","one octillion , one septillion , five sextilli..."
2,2,"sixty-two duodecillion , six hundred twenty-tw...",twenty-one
3,3,"two septillion , six hundred one sextillion , ...","six octillion , three hundred thirty-four sept..."
4,4,"fifty-two trillion , one hundred ninety-seven ...","two hundred octillion , five hundred ten septi..."

In [ ]:
#checking all functions have worked
df.iloc[1,1]

'two hundred two quadrillion , five hundred forty trillion , two hundred thirty-two billion , seven hundred fifty million , one hundred sixty-two thousand twenty-five'

# üèóÔ∏èPreprocessing